#include <iostream>
#include "Queue.h"
#include "List.h"
#include "Deck.h"
#include "Stack.h"

int main()
{
	std::cout << "Hello World!\n";
}
/*
Разработать класс Keeper, который реализует контейнер для хранения и обработки
объектов. Класс Keeper должен обеспечивать следующие функции:
	▪ добавление и удаление производных объектов абстрактного класса Base;
	▪ полное сохранение себя в файле;
	▪ полное восстановление себя из файла. 

Класс Очередь содержит данные о списке, деке и стеке. List, Deck Stack 
В каждом хранятся числа. Необходимо реализовать функционал каждого контейнера на основе очереди.
*/